Revit 2027 API
EffectInstance.SetGlossiness Method
 Sets the glossiness parameter of the effect instance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetGlossiness(
	double glossiness
)
Public Sub SetGlossiness (
	glossiness As Double
)
public:
void SetGlossiness(
	double glossiness
)
member SetGlossiness :
        glossiness : float -> unit
Parameters
glossiness Double
 The glossiness value.
See Also
Reference
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace